Repository: prelydia/diploma
Catalog: diploma/Resources/Views/Home/Info.*.resx
Languages: ru

# Method5Pic1
source: Figure 1. Example of Voronoi Diagram Construction
ru: Рисунок 1. Пример построения диаграммы Вороного

# Method6
source: The Mean Squared Displacement
ru: Среднеквадратичное смещение

# Method6Form1
source: In statistical mechanics, mean square displacement (MSD), also known as root mean square displacement or root mean square deviation, serves as a measure of the deviation in the particle's position from a reference point over time. It is a prevalent measure of the spatial extent of random motion and can be seen as quantifying the portion of a system "explored" by a random walker. In the field of biophysics and environmental engineering, MSD is tracked over time to determine whether particle dispersion is purely due to diffusion or if advective forces also contribute. Another significant concept related to deviations, the Variance of Relative Displacements (VRD), which is twice the square root of MSD, is also employed in studying transport and mixing phenomena in environmental engineering. This is notably relevant in the Debye-Waller factor (describing oscillations in the solid state) and the Langevin equation (describing Brownian particle diffusion).
ru: В статистической механике среднеквадратичное смещение (Mean Squared Displacement) является мерой отклонения положения частицы относительно исходного положения с течением времени. Оно обычно используется для изучения движения частиц в различных физических и биологических системах. Функция MSD заключается в обеспечении понимания динамики и поведения частиц в данной системе. Эта динамика связана с механическими свойствами среды, в которой частицы движутся. MSD может использоваться для анализа диффузионных свойств частиц, определения характера их движения (например, нормального или аномального) и понимания взаимосвязи между движением частиц и системными параметрами, такими как температура или микроструктура. MSD-функция может быть получена с использованием различных математических подходов, таких как квантовая механика или случайные блуждания Леви, в зависимости от конкретной изучаемой системы.

# Method6Form2
source: The Mean Squared Displacement (MSD) at a given time instant
ru: MSD в момент времени

# Method6Form3
source: defined as the ensemble average (statistical mechanics):
ru: определяется как среднее значение по ансамблю (статистическая механика):

# Method6Form4
source: is the number of particles,
ru: число частиц,

# Method6Form5
source: is the total drying time of the droplet.
ru: — полное время процесса.

# Method7
source: Concentric tetratic orientational order
ru: Концентрический параметр тетратического порядка

# Method7Form1
source: Experimental evidence [Sánchez, R., & Aguirre-Manzo, L. A. (2015)] a system of tubular particles placed in a cylindrical cell is presented. A specially developed analysis was used to determine the degree of order of such structures. This analysis can also be applied in other geometries with different border shapes.
ru: В эксперименте [Sánchez, R., & Aguirre-Manzo, L. A. (2015)] изучалась система из трубчатых частиц, размещенных в цилиндрической ячейке. Использовался спецально разработанный анализ для определния степени порядка таких структур. Такой анализ можно применить и в других геометриях с разными формами границ.

# Method7Form10
source: Find the angle <i> θ </i> between two vectors by the formula
ru: Находим угол <i> θ </i> между двумя векторами по формуле

# Method7Form11
source: So we come to the formula
ru: Таким образом, приходим к формуле

# Method7Form12
source: From the cosine double angle formula follows
ru: Из формулы косинуса двойного угла следует

# Method7Form2
source: Elongated rigid particles are common experimentally and include granular systems such as rice, some biological systems and colloidal systems such as nanotubes. Elongated particles can have orientational order.
ru: Удлиненные жесткие частицы часто встречаются в экспериментах, к примеру, в гранулярных системах, некоторых биологических и коллоидных системах, таких как нанотрубки. Морфология скопления удлиненных частиц может характеризоваться ориентационным порядком.

# Method7Form3
source: The tetratic orientation order characterizes the state of the system well if the components are aligned along or perpendicular to a fixed guiding vector, which may be the case in the volume. However, the direction of the tangent to the boundary in the shape of a circle is not fixed, but depends on the angular coordinate (polar coordinate system). Therefore, it is useful to define parameters that take into account the direction tangent to the nearest point of the boundary of the area in the form of a circle. In the region under consideration, this corresponds to the direction perpendicular to the radius vector <b> ϕ </b> directed from the center of the region to the center of the particle. Thus, the concentric parameter of the tetratic order can be defined as
ru: Тетратический ориентационный порядок хорошо характеризует состояние системы, если компоненты выравниваются вдоль или перпендикулярно к фиксированному направляющему вектору, что может иметь место в объеме. Однако направление касательной к границе в форме круга, не является фиксированным, а зависит от угловой координаты (полярная система координат). Поэтому полезно определить параметры, которые учитывают направление, касательное к ближайшей точке границы области в виде окружности. В рассматриваемой области это соответствует направлению, перпендикулярному радиус-вектору <b> ϕ </b>, направленному из центра области к центру частицы. Таким образом, концентрический параметр тетратического порядка можно определить как

# Method7Form81
source: where <i>θ</i> is the angle between the particle orientation and direction <b>ϕ</b> from the central point (x <sub>c</sub>, y<sub>c</sub>) tangent to the circle of the radius
ru: где <i> θ </i> &ndash; угол отклонения стержня от направляющего вектора <b> ϕ </b> из центральной точки (x <sub>c</sub>, y<sub>c</sub>) по касательной к окружности радисом

# Method7Form82
source: . The angular brackets denote an averaging of all particles belonging to a certain sub-area, for example, a ring of specified thickness.
ru: . Угловые скобки обозначают усреднение по всем частицам, входящим в некоторую подобласть, например, в кольцо заданной толщины.

# Method7Form83
source: This parameter becomes zero for an isotropic state (fig.2a). In this case, the angle difference <i> θ </i> can be approximately 22.5° or 67.5°. Because the basis vector is determined by the angular position of the tangent, this parameter may also take negative values. Therefore, for an perfectly tetratic state (fig.2b) with a director permanently located at 45° from the particle orientation, this parameter is -1. The highest value of the tetratic order is 1 (fig.2c). In this case, the angle difference <i> θ </i> is 0° or 90°.
ru: Этот параметр становится нулевым для изотропного состояния (рис.2a). В этом случае значение <i> θ </i> может быть примерно равно 22.5° или 67.5°. Вследствие того, что направляющий вектор определяется угловым положением касательной, этот параметр может также принимать отрицательные значения. Поэтому для идеального тетратического состояния (рис.2b) с направляющим вектором, постоянно расположенным на 45°от ориентации частицы, этот параметр равен -1. Самое высокое значение тетратического порядка равно 1 (рис.2c). В данном случае значение <i> θ </i> равно 0° или 90°.

# Method7Form91
source: Suppose that the coordinates of the central and edge point of the elongated particle are known. On Figure 1, the vector
ru: Предположим, что известны координаты центральной и краевой точки вытянутой частицы. На рис.1 вектор

# Method7Form92
source: is directed longitudinally from the center to the edge of the particle.
ru: направлен продольно частице от центра к краю.

# Method7Pic
source: (fig. 1)
ru: (рис. 1)

# Method7Pic1
source: Figure 1. Determination of the deflection angle <i> θ </i>
ru: Рисунок 1. Определение угла отклонения <i> θ </i>

# Method7Pic2
source: Firure 2. Parameter Configuration Examples
ru: Рисунок 2. Примеры конфигурации параметра

# Methot1Form1
source: To analyze the angular uniformity, orientation order parameter
ru: Для анализа угловой однородности параметр ориентационного порядка связи

# Methot1Form2
source: calculated relatively to the isolated particle j as follows:
ru: относительно изолированной частицы j вычисляется следующим образом:

source: Sources
ru: Использованные источники

# TechImp
source: Technical implementation
ru: Техническая реализация

# TechImpText1
source: In the implemented method, the circle is divided into subdomains of the ring. The number of rings is entered manually, and their width is calculated automatically. You can also set the boundaries of the coordinates <i> r </i> included in the interval [0, <i>R</i>], on which calculations will be performed.
ru: В реализованном методе окружность делится на подобласти &ndash; кольца. Количество колец вводится вручную, а ширина их расчитывается автоматически. Также можно задать границы координаты <i> r </i>, входящие в промежуток [0, <i>R</i>], на которых будут проводиться расчеты. Для каждой палочки расчитывается параметр

# TechImpText2
source: The value of this parameter is averaged over all the sticks entering the sub-area (ring). Thus, the value
ru: . Значение этого параметра усредняется по всем палочкам, входящим в подобласть (кольцо). Таким образом, определяется значение

# TechImpText3
source: for each sub-area is determined. The graph shows the dependence
ru: для каждой подобласти. На график выводится зависимость

# TechImpText4
source: on the coordinate <i>r</i>. Note that the spatial coordinates should be unmarked at radius <i>R</i> in the input files. The scaling of the radius of the circle corresponds to one, and the x,y coordinates range from -1 to 1.
ru: от координаты <i> r </i>. Следует учитывать, что пространственные координаты должны быть обезразмерены на радиус <i>R</i> в файлах с входными данными. Масштабирование радиус круга соответствует единице, а координаты х,у варьируются в диапазоне от -1 до 1.

# Title
source: Implemented methods
ru: Реализованные методы

# Title2
source: You may want to learn more about the methods implemented
ru: Возможно, ты захочешь познакомиться с реализованными методами подробнее

# Title3
source: Here is a description and formulas of all methods. The «Sources» tab contains links with sources where you can find everything you need!
ru: Здесь представлено описание и формулы всех методов. Во вкладке «Литература» находятся ссылки с источниками, где ты можешь найти все, что тебе требуется!
