Repository: prelydia/diploma
Catalog: diploma/Resources/Views/Home/Info.*.resx
Languages: ru

# End
source: th
ru: ой

# Figure1
source: Figure 1. Angle
ru: Рисунок 1. Угол

# Method1
source: Orientation order parameter
ru: Параметр ориентационного порядка связи

# Method1And
source: and the
ru: и

# Method1Desc
source: is a tool used in condensed medium physics to characterize the local structure of a set of neighboring particles around a given central particle. It was introduced by Steinhardt et al. and has since found application in various fields such as glass, jamming, melting, crystallization transitions and cluster formation. Orientation order parameter is a measure of the local structural order in the system. It is based on the idea that the local structure around a particle can be characterized by the arrangement of its adjacent particles. Orientation order parameter has become a standard tool in condensed medium physics, with applications including glass, jamming, melting or crystallization transitions, and cluster formation.
ru: - это инструмент, используемый в физике конденсированных сред для характеристики локальной структуры набора соседних частиц вокруг данной центральной частицы. Он был представлен Steinhardt et al. [1] и с тех пор нашел применение в различных областях, таких как стекло, застревание (jamming), плавление, переходы кристаллизации и формирование кластеров. Параметр ориентационного порядка связи является мерой локального структурного порядка в системе. Он основан на идее о том, что локальная структура вокруг частицы может быть охарактеризована расположением соседних с ней частиц. Параметр ориентационного порядка связи стал стандартным инструментом в физике конденсированных сред, с приложениями, включая стекло, застревание (jamming), переходы плавления или кристаллизации и формирование кластеров.

# Method1Form3
source: is the angle of the line between the center of the isolated S particle (of the middle point of an S particle dimer)
ru: – угол между прямой, соединяющей центры изолированной частицы

# Method1Form4
source: of the particle from its nearest neighbors, the arbitrary fixed axis report (Figure 1)
ru: частицей из числа ее ближайших соседей, и произвольной фиксированной осью отчета (Рисунок 1)

# Method1Form5
source: is the number of immediate neighbours (coordination number),
ru: — число ее ближайших соседей (координационное число),

# Method1Form6
source: is the imaginary unit
ru: — мнимая единица.

# Method1Where
source: where
ru: где

# Method2
source: Assessment of radial uniformity
ru: Оценка радиальной однородности

# Method2Add
source: of colloidal particles
ru: коллоидных частиц

# Method2Form2
source: is an important aspect of quality control in manufacturing processes. Particle homogeneity is often subjectively evaluated by human observers, which can be time-consuming, tedious, and prone to human errors. Therefore, for an objective assessment of homogeneity, a more quantitative and reliable method is required. The proposed method has successfully identified the non-uniformity of particles with TRISO coating, caused by distortion in the radial distribution of particles. Simulation modeling demonstrated that the proposed method of quantitative homogeneity assessment is reliable and effective in detecting non-uniformity in spatial particle distribution. The following parameter was evaluated for assessing radial homogeneity:
ru: Радиальная однородность обычно относится к свойству материала или системы быть однородным по своим характеристикам в радиальном направлении относительно центральной точки, оси или центра масс. Это понятие может применяться в различных областях, таких как физика, инженерия или геометрия. С точки зрения коллоидных частиц радиальная однородность может относиться к равномерности распределения коллоидных частиц относительно центра коллоидной системы. Коллоидные системы включают в себя частицы размером от нескольких нанометров до микрометров, разбросанные в дисперсионной среде, такой как вода. Оценка радиальной однородности коллоидных частиц может включать в себя измерение и анализ концентрации частиц в различных радиальных зонах или расстояниях от центра коллоидной системы. Для оценки радиальной однородности оценивался следующий параметр

# Method2Form3
source: is the distance between the center of L-particle
ru: – это расстояние между центром L-частицы

# Method2Form4
source: S-particle among its nearest neighbors
ru: S-частицей из числа ее ближайших соседей

# Method2Form5
source: is the average distance from the center of an L-particle to S-particles among its nearest neighbors
ru: – это среднее расстояние от центра L-частицы до S-частиц из числа ее ближайших соседей

# Method3
source: Bond length
ru: Длина связи

# Method3And
source: and
ru: и

# Method3And1
source: and the bond length deviation
ru: и длиной связи

# Method3And2
source: defined as:
ru: , которая определяется как

# Method3Form1
source: in colloidal particles
ru: в коллоидных частицах

# Method3Form2
source: is a complex subject, requiring an understanding of both colloids and bond length. A colloid is a mixture in which one substance, composed of microscopically dispersed insoluble particles, is suspended in another substance. The dispersed phase particles have a diameter ranging approximately from 1 nanometer to 1 micrometer. In this context, bond length refers to the average distance between the nuclei of two bonded atoms in a molecule.
ru: — сложная тема, требующая понимания как коллоидов, так и длины связи. <b> Коллоид </b> — это смесь, в которой одно вещество, состоящее из микроскопически диспергированных нерастворимых частиц, взвешено в другом веществе. Частицы дисперсной фазы имеют диаметр приблизительно от 1 нанометра до 1 микрометра. В этом контексте длина связи относится к среднему расстоянию между ядрами двух связанных атомов в молекуле.

# Method3Form3
source: is an inherent property of the bond between atoms of a specific type, relatively independent of the rest of the molecule. This implies that bond length depends on the types of atoms forming the bond, rather than the environment in which the bond exists. In the context of colloidal particles, it is important to note that bond length can vary depending on the particle type and the medium in which it is suspended.
ru: — это передаваемое свойство связи между атомами фиксированного типа, относительно независимое от остальной части молекулы. Это означает, что длина связи зависит от типа атомов, образующих связь, а не от среды, в которой существует связь. В контексте коллоидных частиц важно отметить, что длина связи может варьироваться в зависимости от типа частицы и среды, в которой она находится во взвешенном состоянии.

# Method3Form4
source: In previous studies concerning binary assemblies of superparamagnetic particles, one of such configurations with the potential of periodic space filling, i.e. an isolated S particle between four L particles located at the vertices of a square, was individuated, by studying two different metrics, i.e. the bond orientational order parameter
ru: В предыдущих исследованиях, касающихся бинарных сборок суперпарамагнитных частиц, одна из таких конфигураций с потенциалом периодического заполнения пространства, т.е. изолированная S-частица между четырьмя L-частицами, расположенными в вершинах квадрата, была выделена путем изучения двух разных метрик, т.е. параметра ориентационного порядка связи [см. раздел Параметр ориентационного порядка связи]

# Method3Form5
source: is the distance between the S particle j and the neighbor L particle k and
ru: – расстояние между S-частицей j и соседней L-частицей k,

# Method3Form6
source: is the average distance between the S particle j and the N L nearest neighbors and
ru: – среднее расстояние между S-частицей j и четырьмя соседними L-частицами, также

# Method3Form7
source: for the square arrangement
ru: для квадратной архитектуры. Для идеальной квадратной архитектуры

# Method3Form8
source: In our case, we developed a generalized procedure to identify all the different configurations. Such a procedure is based on the analysis of the angular and radial uniformity of L particles around an isolated S particle or around the middle point of an S particle dimer. First, L nearest neighbors are determined via Voronoi tessellation/Delaunay triangulation. Subsequently, for isolated S particles and the middle points of S particle dimers located within the convex polygons having as vertices three or four L particle neighbors, the angular and radial distribution of L particle neighbors with respect to the isolated S particle or to the middle point of the S particle dimer are scrutinized. The goal of the investigation is to check whether they meet the specific conditions satisfied by the ideal arrangements we are searching for. Such analyses aim at assessing whether the isolated S particle or the middle point of the S particle dimer is located approximately at the incenter of such polygons.
ru: В данном случае была разработана обобщенная процедура для идентификации всех различных конфигураций частиц. Такая процедура основана на анализе угловой и радиальной однородности [см. разделы Параметр ориентационного порядка связи и Оценка радиальной однородности] L-частиц вокруг изолированной S-частицы или вокруг средней точки димера, состоящего из частиц S. Во-первых, количество ближайших соседей L определяется с помощью тесселяции Вороного/триангуляции Делоне. Затем для изолированных S-частиц и средних точек димеров, состоящих из частиц S, расположенных внутри выпуклых многоугольников, имеющих в качестве вершин три или четыре соседних частицы L, тщательно исследуют угловое и радиальное распределение соседей L-частиц относительно изолированной S-частицы или средней точки димера, состоящего из S-частиц. Цель исследования состоит в том, чтобы проверить, соответствуют ли они конкретным условиям, удовлетворяемым идеальным параметрам архитектур (как на примере квадратной архитектуры), которые мы ищем.

# Method3Picture
source: Figure 1. Configurations of L particles around S particles: (a) Isolated S particles present alternatively in the interstices between L particles arranged in a hexagonal pattern; (b) isolated S particles present in the interstices between L particles arranged in a square pattern; (c) isolated S particles present in all the interstices between L particles arranged in a hexagonal pattern; (d) S particle dimers present between L particles arranged in a rhombic pattern; (e) S particles surrounded by L particles with angularly uniform and radially non-uniform distribution; (f) S particles surrounded by L particles with angularly non-uniform and radially non-uniform distribution
ru: Рисунок 1. Конфигурация L-частиц вокруг S-частиц: а) изолированная S-частица между гексагонально расположенными L-частицами; b) изолированная S-частица между L-частицами, расположенными в квадратной архитектуре; c) изолированная S-частица между гексагонально расположенными L-частицами; d) димер, состоящий из S-частиц, между L-частицами, расположенными в ромбической архитектуре;

# Method4
source: The shape factor
ru: Коэффициент формы

# Method4Form1
source: represents a dimensionless quantity used in image analysis and microscopy, which describes the shape of a particle regardless of its size. In general, a colloid is a mixture in which one substance, composed of microscopically dispersed insoluble particles, is suspended in another substance. Some colloids appear semi-transparent due to the Tyndall effect, which involves the scattering of light by particles in the colloid. Other colloids may be opaque or exhibit weak coloring.
ru: представляет собой безразмерную величину, используемую в анализе изображений и микроскопии, которая описывает форму частицы независимо от ее размера. В общем, коллоид представляет собой смесь, в которой одно вещество, состоящее из микроскопически диспергированных нерастворимых частиц, взвешено в другом веществе. Некоторые коллоиды полупрозрачны из-за эффекта Тиндаля, который заключается в рассеянии света частицами в коллоиде. Другие коллоиды могут быть непрозрачными или иметь слабую окраску.

# Method4Form2
source: In addition to the individuation of rhombic arrangements, we proceeded to the classification of their angle in order to understand whether they exhibit a mainly rhombic or square-like arrangement depending on the angle α reported in Figure 1(d). To this end, the ratio between the diagonals of such rhombic arrangements (degenerating in squares in the limit case) can be evaluated. Alternatively, the shape factors
ru: Классификация углов &alpha; многоугольника, образованного при соединении L-частиц, изолирующих S-частицу, поможет понять, имеет ли этот многоугольник преимущественно ромбическую или квадратную конфигурацию. С этой целью можно оценить соотношение между диагоналями такого многоугольника. В качестве альтернативы коэффициент формы

# Method4Form3
source: of the rhombic arrangements having as vertices four L particles and including the isolated S particle j or the middle point j of an S particle dimer can be estimated for the determination of
ru: может быть оценен для определения углов &alpha;. Коэффициент формы относительно изолированной S-частицы или средней точки j S-частицы может быть записан как

# Method4Form4
source: relative to an isolated S particle or to the middle point of an S particle dimer j can be written as:
ru: относительно изолированной S-частицы или средней точки димера j S-частицы может быть записан как:

# Method4Form5
source: represent the perimeter and the area of the rhombus having at the vertices the four L nearest neighbors to an isolated S particle or to the middle point of an S particle dimer j. These metrics allow us to infer the angle α of the rhombi and to distinguish them into three different classes, respectively with
ru: представляют периметр и площадь многоугольника, имеющего в вершинах четыре L ближайших соседей к изолированной S-частице или к средней точке димера j S-частицы.

# Method4Form6
source: The first class corresponds to rhombi degenerating in a configuration of L particles corresponding to a nearly hexagonal arrangement; in the case of closely packed L particles, the interstice between the four L particles would degenerate into two separate interstices for
ru: Первый класс соответствует ромбам, вырождающимся в конфигурацию L-частиц, соответствующую почти гексагональному расположению; в случае плотно упакованных L-частиц промежуток между четырьмя L-частицами вырождался бы в два отдельных промежутка при

# Method4Form7
source: an isolated S particle, for such a configuration of L particles, would be located along the bridge between two neighbor L particles, i.e. along the line connecting the centers of two L particles in contact. The second class would correspond to a more rhombic-like arrangement, while the third class to a more square-like arrangement.
ru: изолированная S-частица при такой конфигурации L-частиц располагалась бы вдоль мостика между двумя соседними L-частицами, т. е. вдоль линии, соединяющей центры двух контактирующих L-частиц. Второй класс соответствовал бы более ромбическому расположению, в то время как третий класс - более квадратному расположению.

# Method4Pic1
source: Figure 1. Angular and radial uniformity of quadrilaterals and triangles of L particles with respect to isolated S particles and S particle dimers: (a) Identification of isolated S particles involved in equilateral triangles and rhombi and of S particle dimers involved in rhombi; (b) classification of rhombi around S particles and S particle dimers according to the angle
ru: Рисунок 1. Угловая и радиальная однородность четырехугольников и треугольников L-частиц по отношению к изолированным S-частицам и S-димерам частиц: (а) идентификация изолированных частиц S, вовлеченных в равносторонние треугольники и ромбы, и димеров частиц S, вовлеченных в ромбы; (b) классификация ромбов вокруг S-частиц и димеров S-частиц в соответствии с углом

# Method4Pic2
source: (c) percentage of isolated S particles involved in equilateral triangles and rhombi and of S particle dimers involved in rhombi for variable particle number ratio
ru: (c) процентное содержание изолированных частиц S, вовлеченных в равносторонние треугольники и ромбы, и димеров частиц S, вовлеченных в ромбы, для соотношения числа частиц

# Method4Pic3
source: (d) angle classes of rhombi around isolated S particles for variable particle number ratio
ru: d) классы углов ромбов вокруг изолированных частиц S для соотношения числа частиц

# Method4Pic4
source: (e) angle classes of rhombi around S particle dimers for variable particle number ratio
ru: (e) классы углов ромбов вокруг димеров частиц S для переменного отношения числа частиц

# Method5
source: The Voronoi diagram
ru: Диаграмма Вороного

# Method5Form1
source: is a partitioning of a plane into regions close to each of a given set of objects. In the simplest case, these objects are just a finite number of points on the plane, called seed points, nodes, or generators. To construct a Voronoi diagram, each cell can be built one after the other. This involves extending the bisectors of the line segments connecting each point combination, which can be quite inefficient. An alternative approach is to first construct the Delaunay triangulation of the points and then extend the bisectors of the triangle edges to obtain the Voronoi diagram. The Delaunay triangulation can be obtained without considering each point pair, and an efficient method involves projecting the points onto a paraboloid in a higher dimension. Another efficient alternative is the Sweep line algorithm, which gradually constructs the Voronoi cells, sequentially using binary search tree operations and a priority queue.
ru: — это разбиение плоскости на области, близкие к каждому из заданного набора объектов. В простейшем случае эти объекты представляют собой просто конечное число точек на плоскости, называемых начальными точками, узлами или генераторами. Чтобы построить диаграмму Вороного, можно построить каждую ячейку одну за другой. Это включает в себя расширение биссектрисы сегментов, соединяющих каждую комбинацию точек, что весьма неэффективно. Альтернативный подход состоит в том, чтобы сначала построить триангуляцию Делоне из точек, а затем продолжить биссектрисы ребер треугольника, чтобы получить диаграмму Вороного. Триангуляцию Делоне можно получить, не рассматривая каждую пару точек, и эффективный метод включает проецирование точек на параболоид в более высоком измерении. Другой эффективной альтернативой является алгоритм Sweep line, который строит ячейки Вороного постепенно, последовательно используя операции бинарного дерева поиска и приоритетной очереди.

# Method5Form2
source: Voronoi cells can be represented combinatorially using their vertices, edges, two-dimensional facets, and so on. Sometimes, the induced combinatorial structure is referred to as the Voronoi diagram. However, in the general case, Voronoi cells can be non-convex and even disconnected. In the usual Euclidean space, each Voronoi polygon corresponds to a generating point. All locations within a Voronoi polygon are closer to the generating point of that polygon than to any other generating point in the Voronoi diagram in the Euclidean plane.
ru: Ячейки Вороного можно представить комбинаторно, используя их вершины, стороны, двумерные грани и т. д. Иногда индуцированную комбинаторную структуру называют диаграммой Вороного. Однако в общем случае клетки Вороного могут быть не выпуклыми и даже не связными. В обычном евклидовом пространстве каждому многоугольнику Вороного соответствует образующая точка. Все местоположения в многоугольнике Вороного ближе к образующей точке этого многоугольника, чем любая другая образующая точка на диаграмме Вороного в евклидовой плоскости.

# Method5Form3
source: There is a straightforward algorithm for constructing the Voronoi diagram. For each point in the plane, one needs to compute the intersection of its circle with circles built around all other points. This intersection defines the Voronoi region boundary for that point. However, computing intersections for each point entails a time complexity that depends on the number of points and may be substantial.
ru: Существует простой алгоритм для построения диаграммы Вороного. Для каждой точки на плоскости нужно вычислить пересечение ее окружности с окружностями, построенными вокруг всех остальных точек. Это пересечение является границей области Вороного для данной точки. Однако, вычисление пересечения для каждой точки имеет временную сложность

# Method5Form4
source: is the number of points in the plane.
ru: — количество точек на плоскости.

# Method5Form5
source: Another algorithm for constructing the Voronoi diagram is a recursive approach that divides the plane into four parts and then continues subdividing each part recursively until each region contains only a single point. This algorithm has a time complexity of O(nlogn), where n is the number of points in the plane.
ru: Другой алгоритм построения диаграммы Вороного — это рекурсивный алгоритм, который делит плоскость на четыре части, а затем рекурсивно продолжает деление каждой части до тех пор, пока каждая область не будет содержать только одну точку. Этот алгоритм имеет временную сложность O(<i>n</i> logn)

# Method5Form6
source: The Voronoi diagram finds wide applications in various fields such as computer graphics, geometric modeling, optimization, and more. For instance, it is used to address the Nelson-Erdős-Hadwiger problem, which involves finding an upper bound for the chromatic number in 2 or 3-dimensional Euclidean space. The properties of the Voronoi diagram are closely related to the Delaunay triangulation, where the Delaunay triangulation for a given set of points in the plane is a partitioning of the plane into triangles, such that no two points are inside the circumcircle of any triangle. There exists a one-to-one correspondence between the Voronoi diagram and the Delaunay triangulation. If the points are connected by edges, where the Voronoi regions share common boundaries, the resulting graph will represent the Delaunay triangulation.
ru: Диаграмма Вороного находит широкое применение в различных областях, таких как компьютерная графика, геометрическое моделирование, оптимизация и т.д. Например, она используется для решения проблемы Нелсона-Эрдёша-Хадвигера, которая заключается в нахождении верхней оценки хроматического числа для евклидова пространства размерности 2 или 3. Свойства диаграммы Вороного тесно связаны с триангуляцией Делоне, где триангуляция Делоне для данного множества точек на плоскости — это такое разбиение плоскости на треугольники, где никакие две точки не находятся внутри окружности, описанной вокруг любого из треугольников. Имеется взаимно-однозначное соответствие между диаграммой Вороного и триангуляцией Делоне. Если соединить ребрами точки, области Вороного которых граничат друг с другом, полученный граф будет являться триангуляцией Делоне.

# Method5Form7
source: In colloidal systems, the Voronoi diagram can be utilized to determine the size and shape of colloidal particles. Colloidal particles can be identified as the centers of Voronoi cells where the volume of the dispersed phase penetrates inside the cell. Since Voronoi cells correspond to the nearest points, particle sizes can be determined as the distance between the centers of neighboring cells.
ru: В коллоидных системах, диаграмма Вороного может использоваться для определения размера и формы коллоидных частиц. Коллоидные частицы могут быть определены как центры ячеек Вороного, в которых объем дисперсной фазы проникает внутрь ячейки. Поскольку ячейки Вороного соответствуют ближайшим точкам, размеры частиц могут быть определены как расстояние между центрами соседних ячеек.
