Repository: prelydia/diploma
Catalog: diploma/Resources/Views/Method/Index.*.resx
Languages: ru

# AddForm
source: Adding parameters form
ru: Форма добавления параметров

# AddParam
source: Add parameter
ru: Добавить параметр

# AlreadyMoved
source: The file has already been moved!
ru: Файл уже перемещен!

# Angles
source: Angles Фjk
ru: Углы Фjk

source: Attention!
ru: Внимание!

# AttnMSD
source: Uploading an archive is only allowed with the .7z extension.
ru: Загрузка архива допускается только с расширением .7z

# AttnSelectFile
source: Select files before running the method!
ru: Выберите файлы перед запуском метода!

# AutoBorders
source: Сalculate borders automatically
ru: Автоматически высчитать границы

source: Cancel
ru: Отмена

# CheckFile
source: Please verify the correctness of the file contents before usage!
ru: Проверьте корректность содержимого файлов перед использованием!

# CheckFileAngle
source: The files should have the following format: the first line specifies the number of nearest neighbors, and the next line contains angles фjk separated by commas
ru: Загружаемые файлы должны содержать в себе информацию о частицах: первые два столбца - координаты х, у; третий столбец - радиус частицы.

# CheckFileDist
source: The files should have the following format: the first line specifies the number of nearest neighbors, and the next line contains distances separated by commas
ru: Файлы должны иметь следующий вид: на первой строке указывается количество ближайших соседей, на следующей - расстояния через запятую.

# Circ1
source: Particles image is imported for recognition.
ru: Импортируется изображение частиц, которые надо распознать.

# Circ2
source: Depending on the image size, its analysis may take up to several minutes.
ru: В зависимости от величины изображения его анализ может занимать до нескольких минут.

source: Close
ru: Закрыть

# CoorConf
source: The content of the particle coordinates file
ru: Содержание файла координат частиц

# CoorGenerated
source: The coordinates have been generated!
ru: Координаты сгенерированы!

# Data1
source: This file contains information about the number of recognized particles and their diameter.
ru: В данном файле хранится информация о количестве распознанных частиц и об их диаметре.

# Data2
source: An example of such a file is presented in the figure below.
ru: Пример такого файла представлен на рисунке ниже.

# DetectedPart
source: Recognized particles
ru: Распознанные частицы

# DirNoFIle
source: There are no files in your directory
ru: В Вашей директории нет файлов

# DownData
source: Download particle data
ru: Скачать данные по частицам

# Download
source: Download files
ru: Скачать файлы

# EnterWarn
source: Enter values in the fields!
ru: Введите значения в поля!

# ErrorFileMove
source: Error occurred while moving the files!
ru: Произошла ошибка при перемещении файлов!

source: Files
ru: Файлы

# FileSuccessMoved
source: The file has been successfully moved!
ru: Файл успешно перемещен!

# FormatError
source: Data format error
ru: Ошибка формата данных

source: From
ru: От

source: Generate
ru: Сгенерировать

# GenerateChaos
source: Chaos
ru: Неупорядочено

# GenerateOrder
source: Order
ru: Упорядочено

source: Generation type
ru: Тип генерации

# GetResult
source: Results obtained!
ru: Результаты получены!

# Graph1
source: Input of parameters in this method is only allowed from files.
ru: Ввод параметров в данном методе допустим только из файлов.

# Graph2
source: Both a configuration file and a particle coordinates file are imported.
ru: Импортируются конфигурационный файл и файл с координатами частиц.

source: Graphic
ru: График

# InfPart
source: Particle data
ru: Данные по частицам

# InputParameters
source: Enter method parameters
ru: Введите параметры метода

# InputValue
source: Enter values in the fields!
ru: Введите значения в поля!

# Instruction1
source: 1. Select the required method from the dropdown list
ru: 1. Выбери требуемый метод из раскрывающего списка

# Instruction2
source: 2. Choose the data source after that (manual input, database input, and file input)
ru: 2. Сразу после этого выбери источник данных (ручной ввод, ввод из БД и ввод из файла)

# Instruction3
source: 3. Always ensure the correctness of the entered data
ru: 3. Обязательно проверь корректность вводимых данных

# Instruction4
source: 4. Click the "Run" button
ru: 4. Нажимай на кнопку «Запустить»

# Instruction5
source: 5. Obtain the results
ru: 5. Получи результаты

# InstructionTitle
source: Instructions for using the methods:
ru: Инструкция по использованию методов:

# IntervalBorder
source: Borders must be in the interval [0, 1]!
ru: Границы должны быть в промежутке [0, 1]!

# IntNring
source: The number of rings must be integer!
ru: Значение количества колец должно быть целочислено!

source: Isolated particle
ru: Изолированная частица

source: Large
ru: Большая

# Method1Par1
source: Number of neighbors
ru: Количество соседей

# Method1Par2
source: Angles in degrees (comma-separated)
ru: Углы в град. (через запятую)

# Method1Par3
source: Distances
ru: Расстояния

# Method1Par4
source: Perimeter of the rhombus
ru: Периметр ромба

# Method1Par5
source: Area of the rhombus
ru: Площадь ромба

# MethodChoose
source: Select a method
ru: Выберите метод

source: Method ID
ru: Id Метода

# MSD1
source: To utilize the method for calculating the mean squared displacement, please upload
ru: Для использования метода поиска среднеквадратичного смещения загрузите

# MSD2
source: The coordinate archive should contain numbered experiment folders (corresponding to the trial number), each containing .txt files with coordinates. The first line of the file specifies the time step. Following that, columns are listed, the number of which corresponds to the dimensionality of the problem.
ru: Архив координат должен содержать пронумерованные папки с испытаниями (но номеру испытания соответственно), в которых содержатся файлы с координатами с расширением .txt. В первой строчке файла указывается временной шаг. Далее указываются столбцы, количество которых соответствует размерности задачи.

# MSD3
source: Download example coordinate file structure
ru: Скачать пример структуры файла

# MSDArchive
source: the coordinate archive
ru: архив координат

# MSDInst
source: Information
ru: Информация

source: Next
ru: Далее

# NoFile
source: Files are not selected
ru: Файлы не выбраны

# NoFileChosen
source: No files selected
ru: Файлы не выбраны

# Nring0
source: The number of rings must be greater than zero!
ru: Количество колец должно быть больше нуля!

# NumIspWrong
source: The number of particles in the trials is different!
ru: Количество частиц в испытаниях отличается!

# NumNeigh
source: Number of nearest neighbors
ru: Количество ближайших соседей

# oneFile
source: You can’t build a graph on one experiment!
ru: Нельзя построить график на одном испытании!

# OpenPic
source: Open the image in the browser
ru: Открыть картинку в браузере

# ParticlesNum
source: Number of particles
ru: Число частиц

# PassPart
source: Particle dispersion
ru: Рассредоточенность частиц

source: Result:
ru: Результат:

# ResultSuccess
source: Results obtained!
ru: Результаты получены!

# RingsNum
source: Number of rings
ru: Количество колец

# S41
source: To use the rod orientation method, you need to upload
ru: Для использования метода ориентационного порядка стержней необходимо загрузить

# S42
source: The archive of the coordinates of the rods should consist of txt-files containing the coordinates of the beginning, middle and end of the rods of two columns (x,y) respectively.
ru: Архив координат палочек должен состоять из txt-файлов, содержащих в себе координаты начала, середины и конца палочек по два столбца (х,у) соответственно.

# S43
source: an archive of rod coordinates here
ru: архив координат частиц

source: Save
ru: Сохранить

# SelectArchive
source: Select a coordinate archive
ru: Выбрать архив координат

# SelectBefore
source: Select files before running the method!
ru: Выберите файлы перед запуском метода!

# SelectConfFile
source: Select a configuration file
ru: Выбрать конфигурационный файл

# SelectCoordFile
source: Select a coordinates file
ru: Выбрать файл с координатами

# SelectFile
source: Select a file
ru: Выбрать файл

# SEM
source: Calculate the root mean square error
ru: Рассчитать среднеквадратичную ошибку

source: Small
ru: Маленькая

# Source1
source: Manual Input
ru: Ручной ввод

# Source2
source: My file
ru: Мой файл

# Source3
source: Data Base
ru: База данных

# SourceChoose
source: Select a data source
ru: Выберите источник данных

# Start
source: Run
ru: Запустить

# SubfieldNum
source: Number of sub-fields
ru: Количество подобластей

source: Success!
ru: Успешно!

# Sure
source: Are you sure?
ru: Вы уверены?

# Title
source: Application of Methods
ru: Применение методов

source: To
ru: До

source: User ID
ru: Id Пользователя

# VerifyData
source: Please verify the accuracy of the entered data!
ru: Проверьте правильность введенных данных!

# VerifyData2
source: Please check the accuracy of the entered data before proceeding!
ru: Проверьте правильность введенных данных перед запуском!

# VorConf
source: Contents of the configuration file
ru: Содержимое конфигурационного файла

# VorConf2
source: An example of input information provided in the form of a particle configuration file is shown in the figure below.
ru: Пример входной информации, поступающей в виде файла конфигурации частиц, представлена на рисунке ниже.

# VorConf3
source: In the execution of the method script, the following quantities are used:
ru: В отработке самого скрипта метода используются такие величины как:

# VorConf4
source: particle count, particle radius_1, particle radius_2, droplet radius, and scaling coefficient
ru: количество частиц, радиус частиц_1, радиус частиц_2, радиус капли и коэффициент обезразмеривания

# VorCoor1
source: An example of a file with particle coordinates is presented in the figure below.
ru: Пример файла с координатами частиц представлен на рисунке ниже.

# VorCoor2
source: *the third and fourth columns are not mandatory
ru: *третий и четвертый столбцы не обязательны

# Warning1004
source: This method is only used for S particles that isolate L-particles
ru: Данный метод применяется только для S-частиц, изолирующих L-частицы

# Wrong
source: Something's wrong...
ru: Что-то не так...

# WrongBorder
source: Error while entering borders!
ru: Ошибка при вводе границ!

# WrongExtension
source: Inappropriate archive extension!
ru: Неподходящее расширение архива!

# WrongParameters
source: The parameters are entered incorrectly!
ru: Неправильно введены параметры!

source: Yes
ru: Да
